{
  "basic_info": {
    "description_header": "Hi everyone!",
    "description": "My name is Jeffrey Liang. I was born in San Jose and grew up in Shanghai attending Shanghai American School. I'm a rising junior studying Computer Science and Economics at Brown University. I'm very interested in pursuring a career in finance, specifically in investment banking, private equity, and venture capital. I'm also very involved in many computer science projects out of personal interest. I'm interested in UI/UX interface of website and mobile applications, fullstack, and machine learning specifically for prediction models. Thanks for viewing my portfolio website!",
    "section_name": {
      "about": "About me",
      "projects": "Projects",
      "skills": "Skills",
      "experience": "Experience"
    }
  },
      "projects": [
        {
          "title": "Third",
          "startDate": "July. 2025 - Present",
          "category": "Startup/Entrepreneurship",
          "description": "Third is a marketplace for temporary third spaces that transforms underutilized places like cafés after hours, rooftops, and empty studios into bookable spots on demand. No coworking passes or minimum spends required - just affordable space to work, create, or connect starting at a few dollars per hour. For users, we provide wide space selections with reliability and comfort at accessible price points. For hosts, Third generates additional revenue past usual hours by repurposing existing spaces. The platform emphasizes transparency in financial metrics, booking status, and amenities while incorporating social features like group bookings and activity feeds. We've launched our MVP website and are preparing the mobile app launch within 2-3 weeks. Our first host space is live with several more in onboarding, and we're actively building demand through Columbia and NYU student communities.",
          "images": [
            "images/third.png",
            "images/third_1.png",
            "images/third_2.png"
          ],
          "url": "https://use-third.com",
          "technologies": [
            {
              "class": "devicon-react-original",
              "name": "React"
            },
            {
              "class": "devicon-typescript-plain",
              "name": "TypeScript"
            },
            {
              "class": "devicon-firebase-plain",
              "name": "Firebase"
            },
            {
              "class": "devicon-tailwindcss-original",
              "name": "Tailwind CSS"
            },
            {
              "class": "fa-brands fa-stripe", 
              "name": "Stripe"
            }
          ]
        },
        {
          "title": "DayGuard",
          "startDate": "Sep. 2024 - Jun. 2025",
          "category": "Startup/Entrepreneurship",
          "description": "As a Project Lead Intern for DayGuard, a CPG company specializing in alcohol aid and liver protection jelly sticks, I oversaw 3 critical business streams: retail expansion, campus ambassador programs, and digital growth. My role involved directly reaching out to 20+ retail stores and supporting partnership negotiations while developing comprehensive ambassador recruitment and training initiatives. I led our social media marketing efforts to enhance brand visibility and drive sales across all channels, achieving a 20% increase in overall sales while maintaining connections with 17 college campus ambassadors and 10+ UGC/micro-influencer partnerships. Most notably, I helped DayGuard reach their first 5-figure month, a significant milestone that demonstrated the effectiveness of our multi-channel growth strategy. A key aspect of my position was maintaining effective team communication and workflow management, which included setting weekly priorities, coordinating schedules, and adjusting project timelines as needed. I also spearheaded our strategic expansion to other prestigious Northeast colleges like Dartmouth and MIT, which included creating scalable onboarding processes for new markets. This position required a blend of strategic planning, team leadership, and hands-on execution across multiple business functions.",
          "images": [
            "images/dayguard.png",
            "images/dayguard1.png",
            "images/dayguard2.png",
            "images/dayguard3.png"
          ],
          "url": "https://dayguard.store/",
          "technologies": [
          ]
        },
        {
          "title": "Beya",
          "startDate": "Sep. 2024 - Apr. 2025",
          "category": "Startup/Entrepreneurship",
          "description": "I was a founding member and technical project lead of Beya, a B2B app designed to empower small and medium-sized businesses with streamlined in-person selling. Beya offers features like inventory management, proximity-based vendor discovery, low-fee tap-to-pay transactions, and sales analytics. During my tenure, we supported over 20 local vendors, processed 1,000+ transactions, and hosted eight successful events at Brown University. Built with React Native and powered by Expo, Firebase, AWS, and Stripe API, Beya combines robust infrastructure with user-friendly functionality. I played a crucial role in getting the app validated and successfully published on the Apple App Store as 'Beya', including securing the Tap-to-Pay Distribution Certificate and navigating the App Store review process. For more on Beya's development and impact, visit our website below.",
          "images": [
            "images/beya.png",
            "images/beya1.png",
            "images/beya2.png"
          ],
          "url": "https://usebeya.com/",
          "technologies": [
            {
              "class": "expo.png",
              "name": "React Expo"
            },
            {
              "class": "devicon-tailwindcss-original",
              "name": "Tailwind CSS"
            },
            {
              "class": "devicon-firebase-plain",
              "name": "Firebase"
            },
            {
              "class": "devicon-amazonwebservices-plain",
              "name": "AWS"
            },
            {
              "class": "fa-brands fa-stripe", 
              "name": "Stripe"
            }
          ]
        },
        {
          "title": "Innovation Dojo",
          "startDate": "Feb. 2024 - May. 2024",
          "category": "Startup/Entrepreneurship",
          "description": "During my freshman spring, I participated in Brown's Innovation Dojo startup accelerator program, where my team and I developed Docferral, a startup concept designed to streamline electronic patient referrals between primary care and private practice doctors. To validate the idea, we conducted extensive interviews with physicians, securing support from leading doctors at HO'OLA, a prominent Hawaiian network of independent physicians. With guidance from mentors and case studies, we crafted a strong business value proposition, performed competitor analysis in the telehealth space, and created a minimum viable product (MVP). Additionally, we developed a revenue model and expansion strategy, culminating in a final pitch where I presented our vision to stakeholders.",
          "images": [
            "images/Dojo_enhanced.png",
            "images/Docferral.png"
          ],
          "url": "https://www.youtube.com/watch?si=7vtjb4MtF1iFqOvF&v=ywj8ohK4qTY&feature=youtu.be",
          "technologies": [
          ]
        },
    {
      "title": "Drone Energy Optimization",
      "startDate": "Aug. 2021 - June. 2023",
      "category": "CS Research",
      "description": "For this project, I collaborated with an STJU applied mathematics professor to address inefficiencies in delivery drones, particularly their frequent need for recharging and limited cargo capacity. Our goal was to reduce the weight of large drone wings using an elastic transportation network optimized for energy efficiency, enabling drones to carry more products over longer periods. By calculating the total elastic potential energy and gravity potential energy of the wings, we minimized the total energy to determine the optimal geometric parameters, such as the radius of internal pipelines. Using MATLAB simulations, we iteratively refined the design, aiming for a structure similar to dragonfly wings, known for their lightweight and efficient design. This work, titled Numerical Algorithm for Transportation Network, was published in the Journal of Applied Mathematics, highlighting our approach to designing significantly lighter and more efficient drone wings.",
      "images": [
        "images/DroneIntialGraph.png",
        "images/DroneEndGraph.png"
      ],
      "url": "https://wap.hillpublisher.com/UpFile/202307/20230731173237.pdf",
      "technologies": [
        {
          "class": "devicon-python-plain",
          "name": "Python"
        },
        {
          "class": "devicon-matlab-plain",
          "name": "Matlab"
        }
      ]
    },
    {
      "title": "SSD Vision Assisted Robocar",
      "startDate": "Feb. 2022 - Aug. 2022",
      "category": "CS Research",
      "description": "For this project, I developed a low-cost, computationally efficient assisted driving system for navigating narrow roads with obstacles. Using a Raspberry Pi, Intel Neural Compute Stick, infrared sensors, an ultrasound sensor, and an SSD (Single Shot Detector) detection camera, I built and programmed a Raspbot Car to classify and avoid people, bikes, and vehicles. The system used OpenVINO to process video streams and adjust controls based on real-time object detection results. Testing trials confirmed the car could safely maneuver around objects or stop when necessary, achieving an average of 7.5 FPS. SSD detection proved more efficient than RCNN, Faster RCNN, or YOLO 3.0 for this setup. This project showcases the potential of cost-effective, efficient solutions for assisted driving, and I hope to continue developing custom detection models to enhance its capabilities.",
      "images": [
        "images/Robocar.png",
        "images/Framework1.png",
        "images/CarTest-2.gif",
        "images/ModelTest-1.gif",
        "images/TrialTest-1.gif",
        "images/TrialTest-2.gif"
      ],
      "url": "",
      "technologies": [
        {
          "class": "devicon-python-plain",
          "name": "Python"
        },
        {
          "class": "openvino.png",
          "name": "Openvino"
        },
        {
          "class": "devicon-tensorflow-original",
          "name": "Tensorflow"
        }
      ]
    },
    {
      "title": "Clothing Wishlist and Preference Tracker",
      "startDate": "December. 2025 - Present",
      "category": "Mini-projects",
      "role": "Individual Contributor",
      "description": "This project is a personal clothing wishlist and preference-tracking platform that allows users to save items via URLs, organize them into named lists, and share them with others using usernames. It focuses on lightweight, frictionless saving rather than full e-commerce, enabling users to track styles they like across brands in one place. The system is built with a Supabase backend featuring row-level security, username-based authentication, and secure sharing logic. Users can manage multiple lists, control visibility, and collaboratively view wishlists. The project explores how personal taste data can be structured, shared, and revisited over time.",
      "images": [
        "images/closet_compare.png"
        ],
      "url": "https://clothing-compare.vercel.app/",
      "technologies": [
        {
          "class": "devicon-python-plain",
          "name": "Python"
        },
        {
          "class": "devicon-vercel-original",
          "name": "Vercel"
        },
        {
          "class": "devicon-supabase-plain",
          "name": "Supabase"
        }
      ]
    },
    {
      "title": " The All-Star Equation: Decoding Basketball’s Elite",
      "startDate": "Feb. 2025 - May. 2025",
      "role":"Researcher", 
      "category": "Mini-projects",
      "description": "For this project, I developed a low-cost, computationally efficient assisted driving system for navigating narrow roads with obstacles. Using a Raspberry Pi, Intel Neural Compute Stick, infrared sensors, an ultrasound sensor, and an SSD (Single Shot Detector) detection camera, I built and programmed a Raspbot Car to classify and avoid people, bikes, and vehicles. The system used OpenVINO to process video streams and adjust controls based on real-time object detection results. Testing trials confirmed the car could safely maneuver around objects or stop when necessary, achieving an average of 7.5 FPS. SSD detection proved more efficient than RCNN, Faster RCNN, or YOLO 3.0 for this setup. This project showcases the potential of cost-effective, efficient solutions for assisted driving, and I hope to continue developing custom detection models to enhance its capabilities.",
      "images": [
        "images/Data Science Final Deliverable.pdf"
      ],
      "url": "https://drive.google.com/file/d/13z6y1KPxdv6Jf4qjiFl67bz6VVfCWtKl/view",
      "technologies": [
        {
          "class": "devicon-python-plain",
          "name": "Python"
        },
        {
          "class": "devicon-tensorflow-original",
          "name": "Tensorflow"
        }
      ]
    },
    {
      "title": "Pitch Recognition and Note Detection from Sheet Music",
      "startDate": "Feb. 2025 - May. 2025",
      "category": "Mini-projects",
      "role": "Researcher",
      "description": "For this project I analyzed over 11,000 NBA player-season records from 2000–2024 to identify which performance metrics best predict NBA All-Star selection. We combined statistical hypothesis testing (one-tailed and paired t-tests, correlation analysis) with machine learning models to evaluate the relationship between offensive involvement, team impact, and All-Star status. Using features such as points per game, usage rate, player impact estimate, and net rating, we built regression and classification models, with K-Nearest Neighbors achieving near-perfect predictive accuracy. Visual analyses revealed a clear “All-Star zone,” where high-usage players on winning teams are disproportionately selected. The results highlight how a small set of advanced offensive metrics can strongly explain elite player recognition, while also acknowledging the role of non-statistical factors like media exposure and fan voting.",
      "images": [
        "images/CSCI 1470 Final Project Poster.pdf"
        ],
      "url": "https://drive.google.com/file/d/1v4vpcINE19tmXLDHQoq2nxMMFvEATZlN/view",
      "technologies": [
        {
          "class": "devicon-python-plain",
          "name": "Python"
        },
        {
          "class": "devicon-matplotlib-plain",
          "name": "Matplotlib"
        }
      ]
    }
  ],
  "experience": [
    {
      "company": "JPMorgan Chase",
      "title": "Incoming Equity Capital Markets Summer Analyst",
      "image": "jpmorgan.png",
      "years": "Jun. 2026 - Aug. 2026",
      "mainTech": [
        "Investment Banking"
      ],
      "technologies": [
        "● Incoming San Francisco IBD Summer Analyst, selected for 9-week training and deal execution program",
        "● Supporting live deals, financial modeling, and pitchbook creation across banking teams",
        "● Expected to collaborate cross-functionally on equity offerings, valuation work, and strategic client deliverables"
      ]
    },
    {
      "company": "Voyager Capital",
      "title": "Venture Capital Summer Analyst",
      "image": "voyagerCapital.png",
      "years": "Jun. 2025 – Aug. 2025",
      "mainTech": [
        "Venture Capital"
      ],
      "technologies": [
        "● Created pitch decks on portfolio financials, product stacks, and revenue models for investor updates",
        "● Built agentic AI tools for legal and rental clients; launched 2 pilots with 30% efficiency gains",
        "● Briefed founding partner daily on pricing, GTM, and outreach across 3 portfolio firms"
      ]
    },
    {
      "company": "Brown Technology & Consulting Group",
      "title": "Vice President",
      "image": "BTCG.png",
      "years": "Jan. 2024 - Jun. 2025",
      "mainTech": [
        "Student Society/Club"
      ],
      "technologies": [
        "● Drove 20% sales growth and helped DayGuard reach their first 5-figure month, a significant milestone",
        "● Managed a team of 7 across 3 workstreams of digital expansion, campus ambassadorship and in-person retail",
        "● Secured 10 retail partnerships in Rhode Island by conducting in-person outreach to 20+ eligible retail stores",
        "● Presented work stream findings to DayGuard CEO and scoped 3 additional tasks weekly to fulfill project outline",
        "● Maintained DayGuard connections with 17+ campus ambassadors and 10+ UGCs partnerships"
      ]
    },
    {
      "company": "Beya: Small Business Assistance App",
      "image": "beya.png",
      "title": "Technical Development Lead",
      "years": "Sep. 2024 – Apr. 2025",
      "mainTech": [
        "Startup"
      ],
      "technologies": [
        "● Led technical development for Beya, a B2B app enhancing small mobile business operations",
        "● Constructed proximity-based features, minimum-fee transactions, inventory management – served 20+ local vendors",
        "● Built AWS, Expo, and Firebase app infrastructure, supporting 10+ monthly active users in beta version",
        "● Processed 1000+ sales transactions, using direct customer feedback from 8 events to implement 20+ features/fixes",
        "● Secured Apple's official Tap-to-Pay Certificate and successfully published 'Beya' on the App Store",
        "● Navigated App Store review process and validation requirements for official launch"
      ]
    },
    {
      "company": "Xiaomi Technology",
      "title": "Algorithm Engineer Intern",
      "image": "Xiaomi.png",
      "years": "Jun. 2024 - Aug. 2024",
      "mainTech": [
        "Internship"
      ],
      "technologies": [
        "● Worked within Xiaomi's smart device R&D, testing and reporting on current leading generative AI models",
        "● Formed 4 technical reports on the fundamental strengths within models, methods for inference improvement",
        "● Assisted in pitching technical findings with compatibility to Xiaomi's hardware products to department executives",
        "● Established an approved company project \"On Device AI Accelerator\" targeting AI specific hardware techniques"
      ]
    },
    {
      "company": "Innovation Dojo Program",
      "title": "3rd Place Pitcher",
      "image": "Dojo_enhanced.png",
      "years": "Feb. 2024 - May. 2024",
      "mainTech": [
        "Student Society/Club"
      ],
      "technologies": [
        "● Selected to participate in Brown's only student-run startup accelerator to create and present a startup idea",
        "● Interviewed 10 primary care and specialist doctors validating \"Docferral,\" an e-referral platform for private practices",
        "● Analyzed 4 health components across 5 telemedicine companies, conducted value proposition and TAM analysis"
      ]
    }
  ]
}